Documents/ЗаписьПациента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ЗаписьПациента</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НужнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиВзрослаяСтоматология</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринимающийСтоматолог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НужныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НужнаяУслуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиВзрослаяСтоматология</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяУслуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиВзрослаяСтоматология</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяУслуга2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиВзрослаяСтоматология</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаписьПациента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
  Процедура НужныеУслугиНужнаяУслугаПриИзменении(Элемент)
	  // Вставить содержимое обработчика.                   
	  СТЧ = Элементы.НужныеУслуги.ТекущиеДанные;
	  СТЧ.Цена1 = РаботаСоСправочниками.РозничкаяЦена(ТекущаяДата(),СТЧ.НужнаяУслуга);  
	  СТЧ.СуммаКОплате = СТЧ.Цена1 + СТЧ.Цена2 + СТЧ.Цена3;
  КонецПроцедуры

&НаКлиенте
  Процедура НужныеУслугиДополнительнаяУслугаПриИзменении(Элемент)
	         СТЧ = Элементы.НужныеУслуги.ТекущиеДанные;
	  СТЧ.Цена2 = РаботаСоСправочниками.РозничкаяЦена(ТекущаяДата(),СТЧ.ДополнительнаяУслуга);
	  СТЧ.СуммаКОплате = СТЧ.Цена1 + СТЧ.Цена2 + СТЧ.Цена3;
  КонецПроцедуры

&НаКлиенте
  Процедура НужныеУслугиДополнительнаяУслуга2ПриИзменении(Элемент)
	 СТЧ = Элементы.НужныеУслуги.ТекущиеДанные;
	  СТЧ.Цена3 = РаботаСоСправочниками.РозничкаяЦена(ТекущаяДата(),СТЧ.ДополнительнаяУслуга2);
	  
	  СТЧ.СуммаКОплате = СТЧ.Цена1 + СТЧ.Цена2 + СТЧ.Цена3;
  КонецПроцедуры
